Repository: vincentBaylly/ComputHand
Catalog: src/locale/messages.*.xlf
Languages: fr

# homeLink
source: Home
fr: Accueil

# resumeMenuLink
source: Resume
fr: CV

# devSkillsLink
source: Dev Skills
fr: Compétences Dev

# sysSkillsLink
source: System Skills
fr: Compétences Systeme

# extraSkillsLink
source: Extra Skills
fr: Compétences Additionnels

# copyrightText
source: Copright © {{year}} - 9383 9322 Quebec Inc. - ComputHand - All Rights Reserved
fr: Droit d'auteur © {{year}} - 9383 9322 Quebec Inc. - ComputHand - Tous droits réservés

# termsServiceLink
source: Terms of Service
fr: Conditions d'utilisation

# extraSkillsTitle
source: EXTRA SKILLS
fr: COMPETENCES ADDITIONNELS

# devSkillsTitle
source: DEV SKILLS
fr: COMPETENCES DEV

# sysSkillsTitle
source: SYSTEM SKILLS
fr: COMPETENCES SYSTEME

# homeTitle
source: Programmer
fr: Programmeur

# homeDescription
source: Specialized in Web - Java/J2EE - Angular
fr: Specialisé en Web - Java/J2EE - Angular

# homeResume
source: Having more than 10 years in IT computing especially in web domain, my last experience provides me the skill to give more than just development expertise. I am today able to lead interviews, provide technical and architectural advices, manage a team and add technical analysis in my deliveries. These past expériences allow me to open my own business today. I am looking for IT contracts to offer my skills more efficiently.
fr: Ayant plus de 10 ans d'expérience dans le domaine des TI particulièrement dans le domaine du web, mes dernières expériences m'ont permis d'élargir mes champs de compétences au-delà du développement. Je peux aujourd'hui faire passer des entrevues, fournir des conseils techniques et architecturaux, diriger une équipe ainsi qu ajouter de l'analyse à mes livraisons techniques. Ces dernières expériences m'ont permis d'ouvrir ma compagnie. Je cherche actuellement des contrats en TI afin d'apporter mes compétences plus efficacement.

# homeGitLink
source: My gitHub with some of my personal project: <a>GitHub - vincentBaylly</a>
fr: Mon gitHub contenant certain de mes projets personnels: <a>GitHub - vincentBaylly</a>

# homeLinkedinLink
source: <a>My LinkedIn</a>
fr: <a>Mon LinkedIn</a>

# resumeDownloadTitle
source: Download My Resume, Here
fr: Télécharger mon CV, Ici

# resumeLink
source: Download Resume
fr: Téléchargement CV

# resumeTitle
source: Development
fr: Développement

# experienceTitle
source: Work Experience
fr: Experience de travail

# soaTitle
source: SOA Technical analyst
fr: Analyste Technique SOA

# soaIntactDescription
source: <strong><a>Intact</a> – OCTOBER 2018 – DECEMBER 2018</strong><br/> Join a Team Squad of 10 members – 6 Developer, 2 QA, 1 Analyst,1 Scrum Master.<br/> Implementation of one of the back-end part in the SOA Architecture, to expose web services for the rating of Intact for Intact third part partner in the west Canada<br/>
fr: <strong><a>Intact</a> – OCTOBER 2018 – DECEMBER 2018</strong><br/> Membre d'un squad de 11 personnes - 6 developpeurs, 2 Analyste d'affaires, 2 QA, 1 Scrum Master.<br/> Evolution dans l'une des parties backend de l'architecture SOA, pour la mise en place de web service pour l’intégration des compagnies partenaires d'Intact de l"Ouest Canadien.<br/>

# technicalTitle
source: Technical Lead
fr: Responsable Technique

# decathlonDescription
source: <strong><a>Decathlon</a> – JUNE 2018 – OCTOBER 2018</strong><br/> Part of a team with 2 Technical leads of at team of 14 peoples.<br/> Developing an application from scratch of tills management to materialized the tills devices.<br/> (manager centralize and middle-ware tills manager installable on any devices)<br/>
fr: <strong><a>Decathlon</a> – JUNE 2018 – OCTOBER 2018</strong><br/> Etant l'un des deux Responsables Techniques d'une equipe de 14 personnes.<br/> Developpement complet d'un application de gestion de caisse pour la dematerialisation des appareils.<br/> (gestionnaire central des caisses ainsi que les applications embarquees sur les caisses)<br/>

# seniorTitle
source: Senior Developer
fr: Développeur Sénior

# montrealTitle
source: <strong><a>Ville de Montréal</a> – FEBRUARY 2018 - MARCH 2018</strong><br/> As senior developer I develop a big part of the middle-ware/back-end of a self content NodeJS application:<br/> • Application conception<br/> • Development and Production Environment implementation<br/> • Application development.<br/>
fr: <strong><a>Ville de Montréal</a> – FEBRUARY 2018 - MARCH 2018</strong><br/> En tant que developpeur senior, j'ai developpe un grand partie du middle-ware/back-end d'un application NodeJS<br/> • Conception Applicative<br/> • Implementation des environnements de developpement et de production<br/> • Developpement de l'application.<br/>

# totalDescription
source: <strong><a>Total</a> – JUNE 2017 - SEPTEMBER 2017</strong><br/> After the outsourcing signing, CGI implement a budget manager.<br/> From the conception to the delivery, I have been in charge of the architecture and the development management.<br/> The application have been implemented in multi-tier architecture. A front end part used the last technology on the market, NodeJS, AngularJS, bower, bootstrap.<br/> The Back end part exposed REST services implemented with Spring REST, Spring Security, Hibernate as well as Flyway to keep the database integrity.<br/>
fr: <strong><a>Total</a> – JUNE 2017 - SEPTEMBER 2017</strong><br/> Suite à la signature de la sous-traitance, CGI a implementé un gestionnaire de budget<br/> De la conception à la livraison, j'ai été en charge de l'architecture et de la gestion du développement<br/> l'application a été implementé dans une architecture multi-tier. Une partie front end utilisant les dernieres technologie sur le marché, NodeJS, AngularJS, bower, bootstrap<br/> The Back end part exposed REST services implemented with Spring REST, Spring Security, Hibernate as well as Flyway to keep the database integrity. La partie backend exposant des services REST implementés avec Spring REST, Spring Security, Hibernate ainsi que Flyway pour la conservation de l'integrité des données de la base<br/>

# californiaDescription
source: <strong><a>California Government, Sacramento</a> – JANUARY 2017 - FEBRUARY 2017</strong><br/> To respond to an IT Challenge propose by the State of California, we develop an notifier application for web and mobile.<br/> This notifications used GEO-Localization to send information about disaster near the user.<br/> This web site was made in collaboration with CGI Sacramento office<br/>
fr: <strong><a>California Government, Sacramento</a> – JANUARY 2017 - FEBRUARY 2017</strong><br/> Dans le cadre d’une réponse à un appel d’offre de l’état de Californie, nous avons développé une application de gestion de notifications.<br/> Ces notifications utilisant la géolocalisation pour transmettre des informations de catastrophe naturelle survenue dans une zone proche de l’utilisateur.<br/> Cette application a été réalisée en collaboration avec les bureaux CGI de Sacramento.<br/>

# contactUsTitle
source: CONTACT US!
fr: CONTACTEZ NOUS!

# nameError
source: Name is required and needs to be at least 3 characters long.
fr: Le nom est obligatoire et doit comporter au moins 3 caractères..

# emailError
source: Needs to be a valid email.
fr: Doit être un email valide.

# messageError
source: Your message is required!
fr: Votre message est obligatoire

# submitButton
source: Submit
fr: Envoyer

# housingDescription
source: Integration the <a>google maps module</a><br/> using <a>duProprio</a> API to add some marker on the maps.<br/> The call to the api is done with <a>express</a>
fr: Integration de la librairie <a>google maps module</a><br/> utilisant <a>duProprio</a> API pour ajouter des marqueurs sur la carte.<br/> L'appel a l'API est fait en utilisant <a>express</a>

# notFoundTitle
source: Not found 404
fr: Page introuvable 404
